import React from 'react';
import * as s from './styled';
import { Descriptions } from 'antd';

export const AboutComponent: React.FC = () => {
  return (
    <s.AboutComponentStyled>
      <Descriptions title="About" bordered column={1}>
        <Descriptions.Item label="Name">Neuro Drawing</Descriptions.Item>
        <Descriptions.Item label="Description">
          Дана інформаційна система являє собою веб-ресурс, який служить для
          перетворення намальованих макетів в креслення за мінімальний час.
          Головними особливостями системи є:  можливість в реальному часі за
          короткий період отримати необхідне оброблене зображення з чіткими
          формами;  можливість створення ескізу на сайті;  збереження ескізу
          до свого особистого кабінету:  збереження обробленого нейронною
          мережею креслення;  збереження креслення в різних форматах; 
          можливість ділитися своїми напрацюваннями з іншими користувачами.
          Даний продукт призначений для широкого спектру користувачів, так як
          система автоматичного розпізнавання креслень покликана вирішити кілька
          проблем:  При використанні в корпоративних цілях - поліпшення якості
          роботи, зниження фінансових витрат за рахунок скорочення часу на
          роботу;  При використанні в повсякденному житті - швидке отримання
          необхідних креслень з рукописних матеріалів і подальше їх використання
          в своїх цілях. Для початку роботи, користувачеві необхідно
          авторизуватися в додатку або зареєструватися. Після вдалої
          аутентифікації користувачеві будуть доступні всі функції, які надає
          веб-ресурс. Спочатку користувач потрапляє на головну сторінку
          веб-застосунку – редактор креслень, звідки має доступ до всіх функцій
          застосунку.
        </Descriptions.Item>
      </Descriptions>
    </s.AboutComponentStyled>
  );
};
